export const BOOK_PROMPT = `
Given the following information about a book, answer the question. Feel free to use knowledge you have not explicity outlined below:

- Primary Name: Ihya Culum Din  
- Secondary Name: إحياء علوم الدين  
- Transliteration: Iḥyāʾ ʿUlūm al-Dīn  
- Slug: ihya-culum-din  
- Number of Versions: 3  
- Versions:  
  * Value: 9472, Source: turath  
  * Value: 0505Ghazali.IhyaCulumDin.JK000001-ara1, Source: openiti  
  * Value: 0505Ghazali.IhyaCulumDin.Shamela0009472-ara1, Source: openiti  
- Genres:  
  * Name: Literature, Secondary Name: الأدب  
  * Name: Creeds and Sects, Secondary Name: العقائد والملل  
  * Name: Sufism, Secondary Name: التصوف 

Table of content: 
1. مقدمة
2. ربع العبادات
3. كتاب العلم
4. الباب الأول في فضل العلم والتعليم والتعلم وشواهده من النقل والعقل
5. فضيلة العلم
6. فضيلة التعلم
7. فضيلة التعليم
8. في الشواهد العقلية
9. الباب الثاني في العلم المحمود والمذموم وأقسامهما وأحكامهما
10. بيان العلم الذي هو فرض كفاية
11. الباب الثالث فيما يعده العامة من العلوم المحمودة وليس منها
12. بيان ما بدل من ألفاظ العلوم
13. بيان القدر المحمود من العلوم المحمودة
14. الباب الرابع في سبب إقبال الخلق على علم الخلاف وتفصيل آفات المناظرة والجدل وشروط إباحتها
15. بيان التلبيس في تشبيه هذه المناظرات بمشاورات الصحابة ومفاوضات السلف
16. بيان آفات المناظرة وما يتولد منها من مهلكات الأخلاق
17. الباب الخامس في آداب المتعلم والمعلم
18. بيان وظائف المرشد المعلم
19. الباب السادس في آفات العلم وبيان علامات علما الآخرة والعلماء السوء
20. الباب السابع في العقل وشرفه وحقيقته وأقسامه
21. بيان شرف العقل
22. بيان حقيقة العقل وأقسامه
23. بيان تفاوت النفوس في العقل
24. كتاب قواعد العقائد
25. الفصل الأول في ترجمة عقيدة أهل السنة في كلمتي الشهادة التي هي أحد مباني الإسلام
26. الفصل الثاني في وجه التدريج إلى الإرشاد وترتيب درجات الاعتقاد
27. الفصل الثالث من كتاب قواعد العقائد في لوامع الأدلة للعقيدة التي ترجمناها بالقدس
28. الفصل الرابع من قواعد العقائد
29. كتاب أسرار الطهارة
30. القسم الأول في طهارة الخبث والنظر فيه يتعلق بالمزال والمزال به والإزالة
31. الطرف الأول في المزال
32. الطرف الثاني في المزال به
33. الطرف الثالث في كيفية الإزالة
34. القسم الثاني طهارة الأحداث ومنها الوضوء والغسل والتيمم ويتقدمها الاستنجاء
35. باب آداب قضاء الحاجة
36. كيفية الاستنجاء
37. كيفية الوضوء
38. فضيلة الوضوء
39. كيفية الغسل
40. كيفية التيمم
41. القسم الثالث من النظافة التنظيف عن الفضلات الظاهرة
42. النوع الأول الأوساخ والرطوبات المترشحة
43. النوع الثاني فيما يحدث في البدن من الأجزاء
44. كتاب أسرار الصلاة ومهماتها
45. الباب الأول في فضائل الصلاة السجود والجماعة والأذان وغيرها
46. فضيلة الأذان
47. فضيلة المكتوبة
48. فضيلة إتمام الأركان
49. فضيلة الجماعة
50. فضيلة السجود 
`.trim();
